<html>

<head>
    <meta content="text/html; charset=UTF-8" http-equiv="content-type">
    <style type="text/css">
        @import url(https://themes.googleusercontent.com/fonts/css?kit=iMc4-4exjgqA-toZgqqJBf35jAjY-31lSKWZb9Fa77M);

        ol {
            margin: 0;
            padding: 0
        }

        table td,
        table th {
            padding: 0
        }

        .c8 {
            color: #000000;
            font-weight: 700;
            text-decoration: none;
            vertical-align: baseline;
            font-size: 27pt;
            font-family: "Open Sans";
            font-style: normal
        }

        .c0 {
            padding-top: 0pt;
            padding-bottom: 0pt;
            line-height: 1.5;
            orphans: 2;
            widows: 2;
            text-align: left;
            height: 11pt
        }

        .c6 {
            color: #000000;
            font-weight: 700;
            text-decoration: none;
            vertical-align: baseline;
            font-size: 15pt;
            font-family: "Open Sans";
            font-style: normal
        }

        .c1 {
            color: #000000;
            font-weight: 400;
            text-decoration: none;
            vertical-align: baseline;
            font-size: 12pt;
            font-family: "Open Sans";
            font-style: normal
        }

        .c4 {
            padding-top: 0pt;
            padding-bottom: 0pt;
            line-height: 1.5;
            orphans: 2;
            widows: 2;
            text-align: left
        }

        .c3 {
            font-size: 12pt;
            font-family: "Open Sans";
            font-weight: 400
        }

        .c2 {
            font-size: 12pt;
            font-family: "Open Sans";
            font-weight: 700
        }

        .c7 {
            background-color: #ffffff;
            max-width: 468pt;
            padding: 72pt 72pt 72pt 72pt
        }

        .c5 {
            font-style: italic
        }

        .title {
            padding-top: 0pt;
            color: #000000;
            font-size: 26pt;
            padding-bottom: 3pt;
            font-family: "Arial";
            line-height: 1.15;
            page-break-after: avoid;
            orphans: 2;
            widows: 2;
            text-align: left
        }

        .subtitle {
            padding-top: 0pt;
            color: #666666;
            font-size: 15pt;
            padding-bottom: 16pt;
            font-family: "Arial";
            line-height: 1.15;
            page-break-after: avoid;
            orphans: 2;
            widows: 2;
            text-align: left
        }

        li {
            color: #000000;
            font-size: 11pt;
            font-family: "Arial"
        }

        p {
            margin: 0;
            color: #000000;
            font-size: 11pt;
            font-family: "Arial"
        }

        h1 {
            padding-top: 20pt;
            color: #000000;
            font-size: 20pt;
            padding-bottom: 6pt;
            font-family: "Arial";
            line-height: 1.15;
            page-break-after: avoid;
            orphans: 2;
            widows: 2;
            text-align: left
        }

        h2 {
            padding-top: 18pt;
            color: #000000;
            font-size: 16pt;
            padding-bottom: 6pt;
            font-family: "Arial";
            line-height: 1.15;
            page-break-after: avoid;
            orphans: 2;
            widows: 2;
            text-align: left
        }

        h3 {
            padding-top: 16pt;
            color: #434343;
            font-size: 14pt;
            padding-bottom: 4pt;
            font-family: "Arial";
            line-height: 1.15;
            page-break-after: avoid;
            orphans: 2;
            widows: 2;
            text-align: left
        }

        h4 {
            padding-top: 14pt;
            color: #666666;
            font-size: 12pt;
            padding-bottom: 4pt;
            font-family: "Arial";
            line-height: 1.15;
            page-break-after: avoid;
            orphans: 2;
            widows: 2;
            text-align: left
        }

        h5 {
            padding-top: 12pt;
            color: #666666;
            font-size: 11pt;
            padding-bottom: 4pt;
            font-family: "Arial";
            line-height: 1.15;
            page-break-after: avoid;
            orphans: 2;
            widows: 2;
            text-align: left
        }

        h6 {
            padding-top: 12pt;
            color: #666666;
            font-size: 11pt;
            padding-bottom: 4pt;
            font-family: "Arial";
            line-height: 1.15;
            page-break-after: avoid;
            font-style: italic;
            orphans: 2;
            widows: 2;
            text-align: left
        }
    </style>
</head>

<body class="c7 doc-content">
    <h1 class="c4 c8">Limbajul de programare Java.</h1>
    <p class="c0"><span class="c1"></span></p>
    <p class="c4"><span class="c1">&Icirc;n prezent, limbajul Java este unul dintre cele mai r&#259;sp&acirc;ndite
            &#537;i populare limbaje de programare. Prima versiune a limbajului a ap&#259;rut &icirc;nc&#259; &icirc;n
            1996 &icirc;n cadrul companiei Sun Microsystems, care ulterior a fost preluat&#259; de Oracle. Java a fost
            conceput ca un limbaj de programare universal, care poate fi utilizat pentru diverse tipuri de sarcini.
            P&acirc;n&#259; &icirc;n prezent, Java a parcurs un drum lung, fiind lansate multe versiuni diferite.
            Versiunea curent&#259; este Java 22, care a fost lansat&#259; &icirc;n martie 2024. De asemenea, Java a
            evoluat dintr-un simplu limbaj universal &icirc;ntr-o &icirc;ntreag&#259; platform&#259; &#537;i ecosistem,
            care reune&#537;te diverse tehnologii folosite pentru o gam&#259; larg&#259; de sarcini: de la crearea de
            aplica&#539;ii desktop p&acirc;n&#259; la dezvoltarea de portaluri &#537;i servicii web de mari dimensiuni.
            &Icirc;n plus, limbajul Java este utilizat activ pentru crearea de software pentru o multitudine de
            dispozitive: PC-uri obi&#537;nuite, tablete, smartphone-uri &#537;i telefoane mobile, ba chiar &#537;i
            pentru electrocasnice. Este suficient s&#259; ne amintim de popularitatea sistemului de operare mobil
            Android, pentru care majoritatea programelor sunt scrise &icirc;n Java.</span></p>
    <p class="c0"><span class="c6"></span></p>
    <p class="c4"><span class="c6">Caracteristici ale Java.</span></p>
    <p class="c0"><span class="c1"></span></p>
    <p class="c4"><span class="c1">Caracteristica principal&#259; a limbajului Java este c&#259; codul s&#259;u este mai
            &icirc;nt&acirc;i transformat &icirc;ntr-un byte-code special, independent de platform&#259;. Apoi, acest
            byte-code este executat de ma&#537;ina virtual&#259; JVM (Java Virtual Machine). &Icirc;n acest sens, Java
            difer&#259; de limbajele interpretate standard, cum ar fi PHP sau Perl, al c&#259;ror cod este executat
            direct de interpret. &Icirc;n acela&#537;i timp, Java nu este nici un limbaj pur compilat, ca C sau
            C++.</span></p>
    <p class="c0"><span class="c1"></span></p>
    <p class="c4"><span class="c1">Aceast&#259; arhitectur&#259; asigur&#259; portabilitatea &#537;i compatibilitatea
            multiplatform&#259; a programelor Java, astfel &icirc;nc&acirc;t acestea pot fi executate f&#259;r&#259;
            recompilare pe diverse platforme - Windows, Linux, Mac OS etc. Pentru fiecare platform&#259; poate exista o
            implementare proprie a ma&#537;inii virtuale JVM, dar toate pot executa acela&#537;i cod.</span></p>
    <p class="c0"><span class="c1"></span></p>
    <p class="c4"><span class="c1">Java este un limbaj cu sintax&#259; similar&#259; cu C &#537;i se aseam&#259;n&#259;
            din acest punct de vedere cu C/C++ &#537;i C#. Prin urmare, dac&#259; sunte&#539;i familiarizat cu unul
            dintre aceste limbaje, ve&#539;i &icirc;nv&#259;&#539;a Java mai u&#537;or.</span></p>
    <p class="c0"><span class="c1"></span></p>
    <p class="c4"><span class="c1">O alt&#259; caracteristic&#259; important&#259; a Java este c&#259; suport&#259;
            colectarea automat&#259; a de&#537;eurilor (garbage collection). Aceasta &icirc;nseamn&#259; c&#259; nu
            trebuie s&#259; elibera&#539;i manual memoria de obiectele utilizate anterior, cum este necesar &icirc;n
            C++, deoarece garbage collector-ul va face acest lucru automat pentru voi.</span></p>
    <p class="c0"><span class="c1"></span></p>
    <p class="c4"><span class="c1">Java este un limbaj orientat pe obiecte. Suport&#259; polimorfismul, mo&#537;tenirea
            &#537;i tipizarea static&#259;. Abordarea orientat&#259; pe obiecte permite rezolvarea problemelor legate de
            construirea de aplica&#539;ii mari, dar &icirc;n acela&#537;i timp flexibile, scalabile &#537;i
            extensibile.</span></p>
    <p class="c0"><span class="c1"></span></p>
    <p class="c4"><span class="c6">Oracle JDK, OpenJDK &#537;i alte JDK.</span></p>
    <p class="c0"><span class="c1"></span></p>
    <p class="c4"><span class="c3">Pentru a dezvolta &icirc;n limbajul de programare Java, avem nevoie de un set special
            de unelte, numit JDK sau Java Development Kit. Totu&#537;i, trebuie men&#539;ionat c&#259; exist&#259;
            diferite implement&#259;ri ale JDK, de&#537;i toate folosesc acela&#537;i limbaj - Java. Cele mai populare
            dou&#259; implement&#259;ri sunt</span><span class="c2">&nbsp;Oracle JDK</span><span
            class="c3">&nbsp;&#537;i </span><span class="c2">OpenJDK</span><span class="c1">.</span></p>
    <p class="c0"><span class="c1"></span></p>
    <p class="c4"><span class="c2">Oracle JDK</span><span class="c3">&nbsp;este dezvoltat &icirc;n &icirc;ntregime de
            compania Oracle. </span><span class="c2">OpenJDK</span><span class="c1">, pe de alt&#259; parte, este un
            proiect open-source, dezvoltat de comunitatea dezvoltatorilor Java, precum &#537;i de mai multe companii,
            inclusiv Oracle, Red Hat &#537;i altele.</span></p>
    <p class="c0"><span class="c1"></span></p>
    <p class="c4"><span class="c1">Diferen&#539;ele majore se refer&#259; la licen&#539;iere &#537;i suport. Conform
            licen&#539;ei Oracle JDK, acesta poate fi utilizat gratuit pentru uz personal, precum &#537;i pentru
            dezvoltarea, testarea &#537;i demonstrarea aplica&#539;iilor. &Icirc;n alte cazuri (de exemplu, pentru
            suport), este necesar&#259; o licen&#539;&#259; comercial&#259; sub form&#259; de abonament. &Icirc;n
            schimb, OpenJDK este complet gratuit.</span></p>
    <p class="c0"><span class="c1"></span></p>
    <p class="c4"><span class="c1">Din punct de vedere func&#539;ional, setul de caracteristici al Oracle JDK &#537;i
            OpenJDK nu ar trebui s&#259; difere semnificativ. Totu&#537;i, exist&#259; observa&#539;ii privind
            performan&#539;a, care sugereaz&#259; c&#259; Oracle JDK poate func&#539;iona pu&#539;in mai rapid
            dec&acirc;t OpenJDK. &Icirc;n plus, unii dezvoltatori men&#539;ioneaz&#259; c&#259; OpenJDK ar putea fi mai
            predispus la bug-uri, &icirc;n timp ce Oracle JDK este considerat mai stabil. &Icirc;n plus, Oracle
            garanteaz&#259; actualiz&#259;ri pentru o anumit&#259; perioad&#259; de timp, &icirc;n timp ce pentru
            OpenJDK, actualiz&#259;rile pot fi incerte.</span></p>
    <p class="c0"><span class="c1"></span></p>
    <p class="c4"><span class="c3">De asemenea, merit&#259; men&#539;ionat c&#259; exist&#259; &#537;i alte
            implement&#259;ri de la diverse companii. De exemplu, Microsoft ofer&#259; propria sa implementare. Aceasta
            poate fi instalat&#259; implicit pe unele versiuni de Windows &#537;i poate fi g&#259;sit&#259; pe Windows
            &icirc;n folderul </span><span class="c3 c5">C:\Program Files\Microsoft</span><span class="c1">.</span></p>
    <p class="c0"><span class="c1"></span></p>
    <p class="c4"><span class="c1">Pentru acest ghid, nu conteaz&#259; ce folosi&#539;i - OpenJDK, JDK de la Oracle,
            Microsoft sau de la alt furnizor.</span></p>
</body>

</html>